describe('Todo List', () => {
  test('-', () => {});

/* 테스트 코드 */
describe('useTodoForm 테스트', () => {
  it('할일 텍스트 데이터를 업데이트하면, 상태값이 업데이트한 데이터로 변경된다.', () => { });
  it('할일 데드라인 데이터를 업데이트하면, 상태값이 업데이트한 데이터로 변경된다.', () => { });
  it('할일을 초기화하면, 상태값은 모두 초기값으로 변경된다.', () => { });
});

describe('TodoList 테스트', () => {
  it('비활성화된 체크박스를 클릭하면 취소선이 그어진다.', () => { });
  it('비활성화된 체크박스를 클릭하면 체크박스가 활성화된다.', () => { });
  it('활성화된 체크박스를 클릭하면 텍스트 스타일이 취소선이 비활성화된다.', () => { });
  it('활성화된 체크박스를 클릭하면 체크박스가 비활성화된다.', () => { });
});

